[
  {
    "scores": [
      68.85714285714286,
      52.75,
      0,
      0,
      0
    ],
    "community": [
      {
        "PkgName": "Flask",
        "stars": 62645,
        "forks": 15584,
        "score": 79
      },
      {
        "PkgName": "click",
        "stars": 13626,
        "forks": 1320,
        "score": 75
      },
      {
        "PkgName": "colorama",
        "stars": 3088,
        "forks": 225,
        "score": 65
      },
      {
        "PkgName": "itsdangerous",
        "stars": 2638,
        "forks": 214,
        "score": 60
      },
      {
        "PkgName": "Jinja2",
        "stars": 9141,
        "forks": 1547,
        "score": 72
      },
      {
        "PkgName": "MarkupSafe",
        "stars": 527,
        "forks": 138,
        "score": 62
      },
      {
        "PkgName": "Werkzeug",
        "stars": 6330,
        "forks": 1686,
        "score": 69
      }
    ],
    "vpkg": [
      {
        "CVE": "CVE-2023-25577",
        "advisory": "Werkzeug 2.2.3 includes a fix for CVE-2023-25577: Prior to version 2.2.3, Werkzeugs multipart form data parser will parse an unlimited number of parts, including file parts. Parts can be a small amount of bytes, but each requires CPU time to parse and may use more memory as Python data. If a request can be made to an endpoint that accesses request.data, request.form, request.files, or request.get_data(parse_form_data=False), it can cause unexpectedly high resource usage. This allows an attacker to cause a denial of service by sending crafted multipart data to an endpoint that will parse it. The amount of CPU time required can block worker processes from handling legitimate requests. The amount of RAM required can trigger an out of memory kill of the process. Unlimited file parts can use up memory and file handles. If many concurrent requests are sent continuously, this can exhaust or kill all available workers.\r\nhttps://github.com/pallets/werkzeug/security/advisories/GHSA-xg9f-g7g7-2323",
        "package_name": "Werkzeug",
        "analyzed_version": ""
      },
      {
        "CVE": "CVE-2023-23934",
        "advisory": "Werkzeug 2.2.3 includes a fix for CVE-2023-23934: Browsers may allow \"nameless\" cookies that look like =value instead of key=value. A vulnerable browser may allow a compromised application on an adjacent subdomain to exploit this to set a cookie like =__Host-test=bad for another subdomain. Werkzeug prior to 2.2.3 will parse the cookie =__Host-test=bad as __Host-test=bad. If a Werkzeug application is running next to a vulnerable or malicious subdomain which sets such a cookie using a vulnerable browser, the Werkzeug application will see the bad cookie value but the valid cookie key.\r\nhttps://github.com/pallets/werkzeug/security/advisories/GHSA-px8h-6qxv-m22q",
        "package_name": "Werkzeug",
        "analyzed_version": ""
      }
    ]
  }
]